new_routes_project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Jeremy"], ["email", "Jeremy_Sleeping?@naps.com"], ["created_at", "2023-04-12 17:57:17.257004"], ["updated_at", "2023-04-12 17:57:17.257004"]]
---
    def create
        user = User.new(users_params)
        if user.save